[
  {
    "word": "Perseverance",
    "pronunciation": "per-suh-VEER-uhns",
    "definition": "Never giving up, even when things get tough",
    "example": "Tom Brady showed incredible perseverance when he came back from 28-3 in the Super Bowl."
  },
  {
    "word": "Tenacious",
    "pronunciation": "tuh-NAY-shus",
    "definition": "Holding on tight and never letting go of your goals",
    "example": "Like Spider-Man's grip, Steph Curry is tenacious when he keeps shooting even after missing."
  },
  {
    "word": "Resilient",
    "pronunciation": "rih-ZIL-yuhnt",
    "definition": "Bouncing back quickly after something bad happens",
    "example": "The Eagles were resilient after losing their quarterback - they kept fighting and won anyway."
  },
  {
    "word": "Integrity",
    "pronunciation": "in-TEG-rih-tee",
    "definition": "Doing the right thing even when nobody's watching",
    "example": "Captain America shows integrity by always telling the truth and keeping his promises."
  },
  {
    "word": "Initiative",
    "pronunciation": "ih-NISH-uh-tiv",
    "definition": "Starting something without being asked or told",
    "example": "Patrick Mahomes took initiative by creating new plays when the coach's plan wasn't working."
  },
  {
    "word": "Accountability",
    "pronunciation": "uh-kown-tuh-BIL-ih-tee",
    "definition": "Taking responsibility for your actions and mistakes",
    "example": "LeBron James shows accountability when he says 'That loss was on me' after a bad game."
  },
  {
    "word": "Decisive",
    "pronunciation": "dih-SY-siv",
    "definition": "Making quick, confident decisions without hesitating",
    "example": "A quarterback must be decisive - throw the ball or run, but don't stand there thinking!"
  },
  {
    "word": "Collaborate",
    "pronunciation": "kuh-LAB-uh-rayt",
    "definition": "Working together as a team to reach a goal",
    "example": "The Avengers collaborate to defeat Thanos - they're stronger together than alone."
  },
  {
    "word": "Articulate",
    "pronunciation": "ar-TIK-yuh-lit",
    "definition": "Speaking clearly so everyone understands exactly what you mean",
    "example": "Peyton Manning was articulate when calling plays - every player knew exactly what to do."
  },
  {
    "word": "Strategic",
    "pronunciation": "struh-TEE-jik",
    "definition": "Having a smart plan to win or succeed",
    "example": "Bill Belichick is strategic - he studies opponents for weeks to find their weaknesses."
  },
  {
    "word": "Empathy",
    "pronunciation": "EM-puh-thee",
    "definition": "Understanding how someone else feels",
    "example": "Spider-Man shows empathy by helping the villain when he realizes he's just scared and hurt."
  },
  {
    "word": "Discipline",
    "pronunciation": "DIS-uh-plin",
    "definition": "Doing what you need to do, even when you don't feel like it",
    "example": "Kobe Bryant had discipline - practicing at 4 AM every day, even on holidays."
  },
  {
    "word": "Humble",
    "pronunciation": "HUM-buhl",
    "definition": "Not bragging about yourself, even when you're awesome",
    "example": "Giannis stays humble - he thanks his teammates after winning MVP instead of boasting."
  },
  {
    "word": "Courageous",
    "pronunciation": "kuh-RAY-jus",
    "definition": "Being brave and doing scary things when it's important",
    "example": "Jackie Robinson was courageous when he became the first Black player in Major League Baseball."
  },
  {
    "word": "Negotiate",
    "pronunciation": "nih-GOH-shee-ayt",
    "definition": "Working out a deal where everyone gets something they want",
    "example": "Iron Man negotiated with Nick Fury - he'd join the Avengers if he could keep his suits."
  },
  {
    "word": "Composure",
    "pronunciation": "kuhm-POH-zhur",
    "definition": "Staying calm and in control when things get crazy",
    "example": "Joe Burrow keeps his composure in the pocket even with 300-pound defenders charging at him."
  },
  {
    "word": "Ambitious",
    "pronunciation": "am-BISH-us",
    "definition": "Having big dreams and working hard to reach them",
    "example": "Michael Jordan was ambitious - he wanted to be the greatest player ever, not just good."
  },
  {
    "word": "Meticulous",
    "pronunciation": "muh-TIK-yuh-lus",
    "definition": "Paying attention to every tiny detail to make something perfect",
    "example": "Batman is meticulous when planning - he thinks of everything that could go wrong."
  },
  {
    "word": "Adaptable",
    "pronunciation": "uh-DAP-tuh-buhl",
    "definition": "Changing your plan quickly when things don't go as expected",
    "example": "Lamar Jackson is adaptable - if passing doesn't work, he switches to running."
  },
  {
    "word": "Optimistic",
    "pronunciation": "op-tuh-MIS-tik",
    "definition": "Believing good things will happen and looking on the bright side",
    "example": "Ted Lasso stays optimistic even when his team loses - 'We'll get them next time!'"
  },
  {
    "word": "Defiant",
    "pronunciation": "dih-FY-uhnt",
    "definition": "Standing up for what's right, even when powerful people disagree",
    "example": "Luke Skywalker was defiant when he refused to join the Dark Side, even facing the Emperor."
  },
  {
    "word": "Considerate",
    "pronunciation": "kuhn-SID-ur-it",
    "definition": "Thinking about how your actions affect other people",
    "example": "Aaron Judge is considerate - he signs autographs for kids even when he's tired."
  },
  {
    "word": "Innovative",
    "pronunciation": "IN-uh-vay-tiv",
    "definition": "Coming up with new, creative ways to solve problems",
    "example": "Stephen Curry was innovative when he started shooting three-pointers from the logo."
  },
  {
    "word": "Relentless",
    "pronunciation": "rih-LENT-lis",
    "definition": "Never stopping or slowing down until you succeed",
    "example": "The Terminator is relentless - he keeps coming no matter what you throw at him."
  },
  {
    "word": "Versatile",
    "pronunciation": "VER-suh-tuhl",
    "definition": "Being good at many different things, not just one",
    "example": "LeBron James is versatile - he can play any position and do it all: score, pass, defend."
  },
  {
    "word": "Diligent",
    "pronunciation": "DIL-ih-juhnt",
    "definition": "Working carefully and steadily without giving up",
    "example": "Jerry Rice was diligent - running the same routes 1000 times until they were perfect."
  },
  {
    "word": "Authentic",
    "pronunciation": "aw-THEN-tik",
    "definition": "Being your true self instead of pretending to be someone else",
    "example": "Kevin Hart is authentic - he makes jokes about his real life instead of faking being cool."
  },
  {
    "word": "Valiant",
    "pronunciation": "VAL-yuhnt",
    "definition": "Showing great bravery, especially in a tough fight",
    "example": "Thor made a valiant effort against Thanos, fighting even when he was outnumbered."
  },
  {
    "word": "Prudent",
    "pronunciation": "PROO-duhnt",
    "definition": "Making smart, careful decisions by thinking ahead",
    "example": "Andy Reid is prudent with timeouts - he saves them for when the team really needs them."
  },
  {
    "word": "Tenacity",
    "pronunciation": "tuh-NAS-ih-tee",
    "definition": "The quality of never giving up, like a bulldog with a bone",
    "example": "Russell Wilson shows tenacity by escaping five tackles and still throwing a touchdown."
  }
]