[
  {
    "author": "Vince Lombardi",
    "quote": "The dictionary is the only place that success comes before work.",
    "explanation": "Like in football, you have to practice before you win games. In the dictionary, 'success' comes before 'work,' but in real life, you work first, then celebrate later."
  },
  {
    "author": "Herm Edwards",
    "quote": "You play to win the game.",
    "explanation": "Don’t just show up — like the Avengers, you fight with a purpose. Play hard, or why play at all?"
  },
  {
    "author": "Dennis Green",
    "quote": "They are who we thought they were. And we let ’em off the hook!",
    "explanation": "Like facing Darth Vader when you knew he’d be tough, but then you didn’t finish the job. Lesson: don’t relax too early — finish strong."
  },
  {
    "author": "Dan Marino",
    "quote": "There is no defense against a perfect pass. I can throw a perfect pass.",
    "explanation": "If you master your skill, no one can stop you. Like Hawkeye hitting the bullseye every time."
  },
  {
    "author": "Archie Griffin",
    "quote": "It’s not the size of the dog in the fight, but the size of the fight in the dog.",
    "explanation": "You don’t need to be Hulk-big to win — even Ant-Man can fight if his heart is strong."
  },
  {
    "author": "Walter Payton",
    "quote": "When you’re GOOD at something, you’ll tell everyone. When you’re GREAT at something, they’ll tell you.",
    "explanation": "Heroes don’t brag. When you’re amazing, the crowd cheers for you — like fans chanting your name."
  },
  {
    "author": "Lou Holtz",
    "quote": "If what you did yesterday seems big, you haven’t done anything today.",
    "explanation": "Yesterday’s touchdown doesn’t win today’s game. Keep pushing forward, like the Rebels who had to fight after blowing up the Death Star."
  },
  {
    "author": "Emmitt Smith",
    "quote": "I may win and I may lose, but I will never be defeated.",
    "explanation": "Even if the scoreboard says you lost, you’re never beaten if you keep your spirit strong — like Captain America standing up again."
  },
  {
    "author": "Pelé",
    "quote": "Success is no accident. It is hard work, perseverance, learning, studying, sacrifice and love of what you are doing.",
    "explanation": "Winning goals don’t happen by luck. It’s training and love for the game — like Jedi training with Yoda."
  },
  {
    "author": "Pep Guardiola",
    "quote": "In football, the worst things are excuses. Excuses mean you cannot grow.",
    "explanation": "Saying 'it’s not my fault' doesn’t make you better. Own it and improve — like Iron Man fixing his own mistakes."
  },
  {
    "author": "Jürgen Klopp",
    "quote": "If you want special results, you have to feel special things and do special things together.",
    "explanation": "Championships aren’t won alone. Teamwork, like the Avengers uniting, makes the magic happen."
  },
  {
    "author": "Sir Alex Ferguson",
    "quote": "Once you bid farewell to discipline, you say goodbye to success.",
    "explanation": "Without rules and practice, you lose. Like a Jedi who ignores the Force."
  },
  {
    "author": "Lionel Messi",
    "quote": "You have to fight to reach your dream. You have to sacrifice and work hard for it.",
    "explanation": "Dreams are like championship rings — you don’t get them without battle scars."
  },
  {
    "author": "Johan Cruyff",
    "quote": "Football is a game of mistakes. Whoever makes the fewest mistakes wins.",
    "explanation": "Every fight has slip-ups. The team that messes up less usually wins."
  },
  {
    "author": "Diego Maradona",
    "quote": "The game of football is like a canvas, and it’s up to the players to paint the most beautiful picture.",
    "explanation": "Each game is your masterpiece — like Spider-Man swinging through the city, your moves tell the story."
  },
  {
    "author": "Xavi",
    "quote": "Football is not about one or two star players. It’s about the team.",
    "explanation": "The Avengers aren’t just Iron Man or Thor. It’s everyone together that saves the world."
  },
  {
    "author": "Tim Howard",
    "quote": "When you’re a goalkeeper, it doesn’t matter how well you play; if you make one mistake and it costs the game, it’s a bad day.",
    "explanation": "One wrong move can ruin everything, so stay sharp like Spider-Sense."
  },
  {
    "author": "Ronaldinho",
    "quote": "I learned all about life with a ball at my feet.",
    "explanation": "Sports can teach you more than school sometimes — teamwork, creativity, joy."
  },
  {
    "author": "Carlos Gracie Sr.",
    "quote": "There is no losing in jiu jitsu. You either win or you learn.",
    "explanation": "Even if you get pinned, you still gain wisdom. Like Luke losing to Vader but learning how to be stronger."
  },
  {
    "author": "Rickson Gracie",
    "quote": "Jiu Jitsu is perfect. It’s humans who make errors.",
    "explanation": "The art is flawless — we just mess up. Like the Force: it’s always right, but Jedi stumble."
  },
  {
    "author": "Jean Jacques Machado",
    "quote": "If you ask me what belt I am today, I’ll tell you that I’m a white belt who never gave up.",
    "explanation": "Being great doesn’t mean being flashy — it means never quitting."
  },
  {
    "author": "John Danaher",
    "quote": "The essential characteristic of jiu jitsu is control that leads to submission.",
    "explanation": "Like a Jedi mind trick — calm control always beats chaos."
  },
  {
    "author": "Renzo Gracie",
    "quote": "My opponent is my teacher, my ego is my enemy.",
    "explanation": "Every battle is a lesson. The real danger is thinking you’re already the best."
  },
  {
    "author": "Carlos Gracie",
    "quote": "The biggest lesson I learned from jiu jitsu was how to truly know myself.",
    "explanation": "Training is like looking in a mirror — you find out how strong, weak, or brave you are."
  },
  {
    "author": "Jim Carrey",
    "quote": "You can fail at what you don’t want, so you might as well take a chance on doing what you love.",
    "explanation": "Even safe paths can flop — so swing for what excites you, like being a superhero."
  },
  {
    "author": "Jim Carrey",
    "quote": "The effect you have on others is the most valuable currency there is.",
    "explanation": "Making people smile, laugh, or feel inspired is worth more than money."
  },
  {
    "author": "Arthur C. Clarke",
    "quote": "Any sufficiently advanced technology is indistinguishable from magic.",
    "explanation": "To kids, a lightsaber is magic. To scientists, it’s tech. Big inventions feel like superpowers."
  },
  {
    "author": "Edwin Hubble",
    "quote": "Man explores the universe and calls the adventure science.",
    "explanation": "Science is just humans on an epic quest — like Star Wars in real life."
  },
  {
    "author": "Galileo Galilei",
    "quote": "In questions of science, the authority of a thousand is not worth the reasoning of a single individual.",
    "explanation": "One brave Jedi’s truth can outweigh a whole army’s lies."
  },
  {
    "author": "Carl Sagan",
    "quote": "Somewhere, something incredible is waiting to be known.",
    "explanation": "Like a treasure hunt across the stars — always more secrets to uncover."
  },
  {
    "author": "Isaac Newton",
    "quote": "If I have seen further it is by standing on the shoulders of giants.",
    "explanation": "Heroes build on the heroes before them — like Rey learning from Luke and Leia."
  },
  {
    "author": "Albert Einstein",
    "quote": "The important thing is not to stop questioning.",
    "explanation": "Curiosity is like the Force — never stop using it."
  },
  {
    "author": "Bruce Lee",
    "quote": "Do not pray for an easy life, pray for strength to endure a difficult one.",
    "explanation": "Don’t wish for no battles. Wish to be strong enough to win them."
  },
  {
    "author": "Plutarch",
    "quote": "The mind is not a vessel to be filled, but a fire to be kindled.",
    "explanation": "Your brain isn’t a bucket for facts — it’s a torch to light up ideas."
  },
  {
    "author": "Elon Musk",
    "quote": "When something is important enough, you do it even if the odds are not in your favor.",
    "explanation": "Like being down 3 touchdowns — you keep playing hard if it matters, just like heroes don’t quit."
  },
  {
    "author": "Elon Musk",
    "quote": "Persistence is very important. You should not give up unless you are forced to give up.",
    "explanation": "Like Captain America saying, 'I can do this all day.' Keep fighting unless you truly can’t."
  },
  {
    "author": "Elon Musk",
    "quote": "I think it is possible for ordinary people to choose to be extraordinary.",
    "explanation": "Like Peter Parker — a regular kid choosing to be Spider-Man. You don’t need powers to be great."
  },
  {
    "author": "Elon Musk",
    "quote": "I feel fear quite strongly… but there are times when something is important enough, you do it in spite of the fear.",
    "explanation": "Like Luke Skywalker — scared of Vader but still facing him. Bravery is acting even when afraid."
  },
  {
    "author": "Elon Musk",
    "quote": "The first step is to establish that something is possible; then probability will occur.",
    "explanation": "First, believe you can score the touchdown — then practice until it happens often."
  },
  {
    "author": "Elon Musk",
    "quote": "Failure is an option here. If things are not failing, you are not innovating enough.",
    "explanation": "Like Iron Man testing new suits. Some explode, but that’s how he builds better ones."
  },
  {
    "author": "Elon Musk",
    "quote": "You should take the approach that you’re wrong. Your goal is to be less wrong.",
    "explanation": "Like Yoda teaching Luke — accept mistakes, learn, and be a little better each time."
  },
  {
    "author": "Elon Musk",
    "quote": "It is important to view knowledge as a semantic tree… understand the trunk and big branches before the leaves.",
    "explanation": "Like football — learn the basics before the fancy plays. Strong roots first."
  },
  {
    "author": "Elon Musk",
    "quote": "Some people don’t like change, but you need to embrace change if the alternative is disaster.",
    "explanation": "Like a coach switching plays — change feels weird, but sticking with the old one could lose the game."
  },
  {
    "author": "Elon Musk",
    "quote": "I wouldn’t say I have a lack of fear… I’d like my fear emotion to be less because it’s very distracting.",
    "explanation": "Like being nervous before a big game — fear is normal, but you can learn to focus and win anyway."
  }
]